app/views/users/_user.html.slim

    li.top-user.name Name: #{link_to user.first_name + ' ' + user.last_name, user}
    li.top-user.score Score: #{user.total_score} points after #{user_games_excluding_learning(user)} #{user.games.size > 1 ? 'games' : 'game'}.
---
SELECT COUNT(*) FROM "games" WHERE "games"."user_id" = $1 AND (games.game_rules IS NOT 'practice' AND games.game_rules IS NOT 'learn')  [["user_id", 3]]