app/controllers/games_controller.rb

    def create
        rounds = params[:rounds][:total].to_i
        time_limit = !!params[:time_limit]
        game_type = params[:game_type]

        new_game_data = {
                            game_type: game_type,
                            rounds: rounds,
                            time_limit: time_limit,
                            finished_rounds: 0,
                            user_id: current_user,
                            time_taken: 0,
                            score: 0
                        }

        game = GameSetupService.new.setup_game(new_game_data)
        game.save
---
INSERT INTO "games" ("game_type", "score", "rounds", "time_taken", "user_id", "time_limit", "finished_rounds", "game_rules") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["game_type", "all"], ["score", 0], ["rounds", 2], ["time_taken", 0], ["user_id", 3], ["time_limit", "f"], ["finished_rounds", 0], ["game_rules", "learn"]]

    def report
        redirect_to(users_path) && return if !@game

        if @game.finished_rounds != @game.rounds
            @game.finished_rounds = @game.rounds
            @game.save
---
UPDATE "games" SET "finished_rounds" = $1 WHERE "games"."id" = $2  [["finished_rounds", 3], ["id", 30]]

    def submit
        selected, answer = params[:person].keys.first.split('#')

        if answer == selected
            @game.score += 2
            flash[:success] = 'Correct answer.'
        else
            flash[:error] = 'Incorrect answer.'
        end

        @game.finished_rounds += 1
        @game.save
---
UPDATE "games" SET "score" = $1, "finished_rounds" = $2 WHERE "games"."id" = $3  [["score", 2], ["finished_rounds", 2], ["id", 5]]

    def find_current_game
        @game = Game.find_by(id: params[:id], user_id: current_user)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 AND "games"."user_id" = $2 LIMIT $3  [["id", 10], ["user_id", 3], ["LIMIT", 1]]