app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        if current_user
            if params[:id].to_i == current_user
                redirect_to edit_user_path params[:id]
            else
                user = User.find_by(id: params[:id])

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @user = User.new(create_user_params)

        if @user.save

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "Jim"], ["last_name", "Tremblay"], ["password_digest", "$2a$04$w1yNOYi0trmdF0e8iwVr/e8NxpstlWCDdXG7hEpdzve.JP5ErGilK"], ["updated_at", "2017-12-05 07:47:56.790173"], ["id", 42]]
---
    def update
        if @user.update(update_user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        if @user.id == current_user
            session[:user_id] = nil
            @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def find_user
        @user ||= User.find_by(id: params[:id])